Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/SUI_НастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиТаблицИнтеграции</name>
  <resources>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/Forms/НастройкаТаблиц/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ТекущаяТаблицаИнтеграции;

&НаКлиенте
Перем ВладелецСхемыКонструктораСКД;

&НаКлиенте
Перем КомпоновщикМодифицирован;
&НаКлиенте
Перем ВладелецКомпоновщика;

&НаКлиенте
Перем НастройкаБылаЗаписана;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РедактируемаяТаблицаИнтеграции = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТаблицаИнтеграции");
	
	Если ЗначениеЗаполнено(РедактируемаяТаблицаИнтеграции) Тогда
		
		Если Не ТекущийМодульМенеджера().НастраиваемаяТаблица(РедактируемаяТаблицаИнтеграции) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Для таблицы ""%1"" не требуется настройка'"), РедактируемаяТаблицаИнтеграции);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			Возврат;
		Иначе
			Заголовок = СтрШаблон(НСтр("ru = 'Настройка таблицы: %1'"), РедактируемаяТаблицаИнтеграции);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьДеревоНастроекНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("КонструкторСхемыКомпоновкиДанных") Тогда
		ОткрытьКонструкторСхемыКомпоновкиДанныхЗавершение(ИсточникВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПередЗакрытиемСохранитьНастройкиПродолжить", ЭтотОбъект);
		
		ПоказатьВопрос(ОповещениеОЗавершении, 
			НСтр("ru = 'Настройки были модифицированны. Сохранить настройки перед закрытием?'"), 
			РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе
		
		Если НастройкаБылаЗаписана <> Неопределено И НастройкаБылаЗаписана Тогда
			СтандартнаяОбработка = Ложь;
			Отказ = Истина;
			НастройкаБылаЗаписана = Неопределено;
			Закрыть(Истина);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоНастроек

&НаКлиенте
Процедура ДеревоНастроекПриАктивизацииСтроки(Элемент)

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНастройкиКомпоновщикаВладельцу();
	
	Если Элемент.ТекущиеДанные.ЭтоСтрокаТаблицы Тогда
		УстановитьСтраницуКД_Пустая();
	Иначе
		НачатьИнициализациюСтраницыНастройкиКомпоновкиДанных();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКолонкиТаблицыИнтеграции

&НаКлиенте
Процедура КолонкиТаблицыИнтеграцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "КолонкиТаблицыИнтеграцииИмя" Тогда
		
		ЗаголовокПоля = Элемент.ТекущиеДанные.Имя;
		
		ПолеСЗаголовкомСуществует = Ложь;
	
		Для Каждого ЭлементВыбора Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
			
			Если ЭлементВыбора.Заголовок = ЗаголовокПоля Тогда
				
				Если Не ЭлементВыбора.Использование Тогда
					ЭлементВыбора.Использование = Истина;
				КонецЕсли;
				
				ПолеСЗаголовкомСуществует = Истина;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ПолеСЗаголовкомСуществует Тогда
			НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			НовоеПоле.Заголовок = ЗаголовокПоля;
		КонецЕсли;
	
	ИначеЕсли Поле.Имя = "КолонкиТаблицыИнтеграцииОписание" Тогда
		
		Если Элемент.ТекущиеДанные.Обязательный Тогда
			ТекстСправки = СтрШаблон(НСтр("ru = 'Обязательный реквизит!
			|
			|%1'"), Элемент.ТекущиеДанные.Описание); 
		Иначе
			ТекстСправки = Элемент.ТекущиеДанные.Описание;
		КонецЕсли;
		
		ПоказатьЗначение(, ТекстСправки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиВыбор

&НаКлиенте
Процедура НастройкиВыборПриИзменении(Элемент)
	УстановитьПризнакМодификацииКомпоновщика();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПользовательскиеПоля

&НаКлиенте
Процедура НастройкиПользовательскиеПоляПриИзменении(Элемент)
	УстановитьПризнакМодификацииКомпоновщика();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиОтбор

&НаКлиенте
Процедура НастройкиОтборПриИзменении(Элемент)
	УстановитьПризнакМодификацииКомпоновщика();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПараметрыДанных

&НаКлиенте
Процедура НастройкиПараметрыДанныхПриИзменении(Элемент)
	УстановитьПризнакМодификацииКомпоновщика();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ДеревоНастроек

&НаКлиенте
Процедура ЗагрузитьДеревоНастроек(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьДеревоНастроекПродолжить", ЭтотОбъект);
	
	Если Модифицированность Тогда
		ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Настройки не были сохранены! Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОбъектНастройки(Команда)
	
	ДанныеТаблицы = ПолучитьДанныеТекущийТаблицыИнтеграции();
	
	Если ДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДобавитьОбъектНастройкиПродолжить", ЭтотОбъект, ДанныеТаблицы.ПолучитьИдентификатор());
	
	ВыбратьОбъектМетаданных(ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбъектНастройки(Команда)
	
	ДанныеОбъекта = ПолучитьДанныеТекущегоОбъекта();
	
	Если ДанныеОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстВопроса = СтрШаблон(НСтр("ru = 'Удалить объект настройки ""%1"" из настройки таблицы ""%2""?'"), 
		ДанныеОбъекта.Представление, ДанныеОбъекта.ТаблицаИнтеграции);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалитьОбъектНастройкиЗавершение", ЭтотОбъект, ДанныеОбъекта.ПолучитьИдентификатор());
	
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура НазначитьОсновнымОбъектом(Команда)
	
	ДанныеОбъекта = ПолучитьДанныеТекущегоОбъекта();
	
	Если ДанныеОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТаблицы = ПолучитьДанныеТекущийТаблицыИнтеграции();
	
	Если ДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеОбъектаТаблицы Из ДанныеТаблицы.ПолучитьЭлементы() Цикл
		
		Если ДанныеОбъектаТаблицы.ОсновнойОбъект Тогда
			ДанныеОбъектаТаблицы.ОсновнойОбъект = Ложь;
			ДанныеОбъектаТаблицы.Модифицированность = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеОбъекта.ОсновнойОбъект = Истина;
	ДанныеОбъекта.Модифицированность = Истина;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьРедакторСКД(Команда)

	ОткрытьКонструкторСхемыКомпоновкиДанных();

КонецПроцедуры

&НаКлиенте
Процедура РезультатКомпоновкиДанных(Команда)

	ДанныеОбъекта = ПолучитьДанныеТекущегоОбъекта();
	
	Если ДанныеОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНастройкиКомпоновщикаВладельцу();
	
	ПараметрыВыводаРезультата = Новый Структура();
	ПараметрыВыводаРезультата.Вставить("Заголовок", "Таблица " + Строка(ДанныеОбъекта.ТаблицаИнтеграции) + " - " + ДанныеОбъекта.Представление);
	ПараметрыВыводаРезультата.Вставить("СхемаКомпоновкиДанных", ДанныеОбъекта.СхемаКомпоновкиДанных);
	ПараметрыВыводаРезультата.Вставить("НастройкиКомпоновкиДанных", ДанныеОбъекта.НастройкиКомпоновкиДанных);
	
	ОткрытьФорму("РегистрСведений.SUI_НастройкиТаблицИнтеграции.Форма.РезультатКомпоновкиДанных", 
		ПараметрыВыводаРезультата, ЭтотОбъект, УникальныйИдентификатор, Окно);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкуКомпоновкиДанных(Команда)
	
	ПроверитьНастройкиКомпоновкиДанных(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиИзДерева(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиИЗакрыть(Команда)
	СохранитьНастройкиИзДерева(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТекущийМодульМенеджера()
	Возврат РегистрыСведений.SUI_НастройкиТаблицИнтеграции;
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()
	
	Если ДеревоНастроек.ПолучитьЭлементы().Количество() = 0 Тогда
		Элементы.ДеревоНастроекГруппаДействияНадОбъектом.Доступность = Ложь;
		Элементы.ДеревоНастроекКонтекстноеМенюГруппаДействияНадОбъектом.Доступность = Ложь;
	Иначе
		Элементы.ДеревоНастроекГруппаДействияНадОбъектом.Доступность = Истина;
		Элементы.ДеревоНастроекКонтекстноеМенюГруппаДействияНадОбъектом.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеТекущейСтрокиДереваНастроек()
	Возврат Элементы.ДеревоНастроек.ТекущиеДанные;
КонецФункции

&НаКлиенте
Функция ПолучитьДанныеТекущегоОбъекта()
	
	ТекущиеДанные = ПолучитьДанныеТекущейСтрокиДереваНастроек();
	
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.ЭтоСтрокаТаблицы Тогда
		Возврат Неопределено;
	Иначе
		Возврат ТекущиеДанные;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДанныеТекущийТаблицыИнтеграции()
	
	Перем ДанныеТаблицыИнтеграции;
	
	ДанныеТекущейСтроки = ПолучитьДанныеТекущейСтрокиДереваНастроек();
	
	Если ДанныеТекущейСтроки <> Неопределено Тогда
		
		Если ДанныеТекущейСтроки.ЭтоСтрокаТаблицы Тогда
			ДанныеТаблицыИнтеграции = ДанныеТекущейСтроки;
		Иначе
			ДанныеТаблицыИнтеграции = ДанныеТекущейСтроки.ПолучитьРодителя();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеТаблицыИнтеграции;

КонецФункции

&НаКлиенте
Процедура ДобавитьОбъектНастройкиПродолжить(ИмяОбъектаНастройки, ИдентификаторТаблицыИнтеграции) Экспорт
	
	Если ЗначениеЗаполнено(ИмяОбъектаНастройки) Тогда
		ДобавитьОбъектНастройкиПродолжитьНаСервере(ИдентификаторТаблицыИнтеграции, ИмяОбъектаНастройки, 
			КомпоновщикМодифицирован, ВладелецКомпоновщика);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьОбъектНастройкиПродолжитьНаСервере(ИдентификаторТаблицыИнтеграции, ИмяОбъектаНастройки,
	ПризнакМодификцииКомпоновщика, ВладелецКомпоновщика)
	
	Перем ТекущаяСтрока;

	ДанныеТаблицыИнтеграции = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторТаблицыИнтеграции);
	
	Если ДанныеТаблицыИнтеграции <> Неопределено И
		ТекущийМодульМенеджера().ПроверитьОбъектКонфигурации(ИмяОбъектаНастройки) Тогда
		
		ЕстьОсновнойОбъект = Ложь;
		
		ОбъектыТаблицыНастройки = ДанныеТаблицыИнтеграции.ПолучитьЭлементы();
		
		Для Каждого СтрокаОбъектТаблицыНастройки Из ОбъектыТаблицыНастройки Цикл
			
			Если СтрокаОбъектТаблицыНастройки.ИмяОбъектаКонфигурации = ИмяОбъектаНастройки Тогда
				ТекущаяСтрока = СтрокаОбъектТаблицыНастройки.ПолучитьИдентификатор();
			КонецЕсли;
			
			Если СтрокаОбъектТаблицыНастройки.ОсновнойОбъект Тогда
				ЕстьОсновнойОбъект = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТекущаяСтрока = Неопределено Тогда

			НовыйОбъект 							= ОбъектыТаблицыНастройки.Добавить();
			НовыйОбъект.ТаблицаИнтеграции 			= ДанныеТаблицыИнтеграции.ТаблицаИнтеграции;
			НовыйОбъект.ИмяОбъектаКонфигурации 		= ИмяОбъектаНастройки;
			НовыйОбъект.Представление 				= ТекущийМодульМенеджера().ПредставлениеСтрокиДерева(НовыйОбъект.ИмяОбъектаКонфигурации);
			НовыйОбъект.ИндексКартинки 				= ТекущийМодульМенеджера().ИндексКартинкиПоИмениОбъекта(НовыйОбъект.ИмяОбъектаКонфигурации);
			НовыйОбъект.ОсновнойОбъект 				= ?(ЕстьОсновнойОбъект, Ложь, Истина);
			НовыйОбъект.СхемаКомпоновкиДанных 		= ОбщегоНазначения.ЗначениеВСтрокуXML(Неопределено);
			НовыйОбъект.НастройкиКомпоновкиДанных 	= ОбщегоНазначения.ЗначениеВСтрокуXML(Неопределено);
			НовыйОбъект.Модифицированность 			= Истина;
			НовыйОбъект.Ключ 						= Новый УникальныйИдентификатор();
			
			ПризнакМодификцииКомпоновщика = Истина;
			ВладелецКомпоновщика = НовыйОбъект.ПолучитьИдентификатор();
			
			Модифицированность = Истина;
			
			ТекущаяСтрока = НовыйОбъект.ПолучитьИдентификатор();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Элементы.ДеревоНастроек.ТекущаяСтрока = ТекущаяСтрока;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбъектНастройкиЗавершение(Ответ, ИдентификаторОбъекта) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОбъекта = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторОбъекта);
		
	Если ДанныеОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеОбъекта.ПолучитьИдентификатор() = ВладелецКомпоновщика Тогда
		ВладелецКомпоновщика = Неопределено;
		КомпоновщикМодифицирован = Ложь;
	КонецЕсли;
		
	ДанныеРодителя = ДанныеОбъекта.ПолучитьРодителя();
		
	Если ДанныеРодителя = Неопределено Тогда
		ЭлементыДерева = ДеревоНастроек.ПолучитьЭлементы();
	Иначе
		ЭлементыДерева = ДанныеРодителя.ПолучитьЭлементы();
	КонецЕсли;
		
	ЭлементыДерева.Удалить(ДанныеОбъекта);
	Модифицированность = Истина;
	
	Если ДанныеОбъекта.ЕстьОшибки И ДанныеРодителя <> Неопределено И ДанныеРодителя.ЕстьОшибки Тогда
		
		ЕстьОшибки = Ложь;
		
		Для Каждого Элемент Из ЭлементыДерева Цикл
			Если Элемент.ЕстьОшибки Тогда
				ЕстьОшибки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ДанныеРодителя.ЕстьОшибки = ЕстьОшибки
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемСохранитьНастройкиПродолжить(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьНастройкиИзДерева(Истина);
	КонецЕсли;
	
КонецПроцедуры

#Область ЗагрузитьДеревоНастроек

&НаКлиенте
Процедура ЗагрузитьДеревоНастроекПродолжить(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗагрузитьДеревоНастроекНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДеревоНастроекНаКлиенте()
	
	ДлительнаяОперация = ЗагрузитьДеревоНастроекНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьДеревоНастроекЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьДеревоНастроекНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	
	Если ЗначениеЗаполнено(РедактируемаяТаблицаИнтеграции) Тогда
		ПараметрыПроцедуры.Вставить("ТаблицаИнтеграции", РедактируемаяТаблицаИнтеграции);
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.SUI_НастройкиТаблицИнтеграции.СформироватьДеревоНастроек", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДеревоНастроекЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		
		ЗагрузитьДеревоНастроекЗавершениеНаСервере(Результат.АдресРезультата);
		
		Для каждого ЭлементДерева Из ДеревоНастроек.ПолучитьЭлементы() Цикл
        	Элементы.ДеревоНастроек.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
		
		ОбновитьОтображениеЭлементов();
		
		Модифицированность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДеревоНастроекЗавершениеНаСервере(АдресХранения)
	
	Дерево = ПолучитьИзВременногоХранилища(АдресХранения);
	
	Если ТипЗнч(Дерево) = Тип("ДеревоЗначений") Тогда
		Дерево.Колонки.Добавить("Модифицированность", Новый ОписаниеТипов("Булево"));
		ЗначениеВРеквизитФормы(Дерево, "ДеревоНастроек");
	Иначе
		ДеревоНастроек.ПолучитьЭлементы().Очистить();
	КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ВыборОбъектаМетаданных

&НаКлиенте
Процедура ВыбратьОбъектМетаданных(ОповещениеОЗавершении)
	
	Коллекции = Новый СписокЗначений;
	
	Коллекции.Добавить("Справочники");
	Коллекции.Добавить("РегистрыСведений");
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ВыборЕдинственного", Истина);
	ПараметрыПодбора.Вставить("КоллекцииВыбираемыхОбъектовМетаданных", Коллекции);
	ПараметрыПодбора.Вставить("СпособГруппировкиОбъектов", "ПоВидам");
	ПараметрыПодбора.Вставить("Заголовок", НСтр("ru = 'Выбор объекта конфигурации'"));
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьОбъектМетаданныхЗавершение", ЭтотОбъект, ОповещениеОЗавершении);
	
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", ПараметрыПодбора, ЭтотОбъект, КлючУникальности, , , Оповещение, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОбъектМетаданныхЗавершение(ВыбранныеЗначения, ОповещениеОЗавершении) Экспорт
	
	ВыбранныйОбъектМетаданных = Неопределено;
	
	Если ЗначениеЗаполнено(ВыбранныеЗначения) Тогда
		ВыбранныйОбъектМетаданных = ВыбранныеЗначения[0].Значение;
	КонецЕсли;

	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ВыбранныйОбъектМетаданных);

КонецПроцедуры

#КонецОбласти

#Область СтраницаНастройкиКомпоновкиДанных

&НаКлиенте
Процедура УстановитьСтраницуКД_Пустая()
	Элементы.ГруппаСтраницыКомпоновкаДанныхНастройки.ТекущаяСтраница = Элементы.ГруппаСтраницаКомпоновкаДанныхНастройкиПустая;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуКД_Ожидание()
	Элементы.ГруппаСтраницыКомпоновкаДанныхНастройки.ТекущаяСтраница = Элементы.ГруппаСтраницаКомпоновкаДанныхНастройкиОжидание;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуКД_Основная()
	Элементы.ГруппаСтраницыКомпоновкаДанныхНастройки.ТекущаяСтраница =  Элементы.ГруппаСтраницаКомпоновкаДанныхНастройки;
КонецПроцедуры

&НаКлиенте
Процедура НачатьИнициализациюСтраницыНастройкиКомпоновкиДанных()
	
	УстановитьСтраницуКД_Ожидание();
	
	ПодключитьОбработчикОжидания("ИнициализироватьСтраницуНастройкиКомпоновкиДанных", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСтраницуНастройкиКомпоновкиДанных()
	
	ОчиститьСообщения();
	
	SUI_КомпоновкаДанныхКлиентСервер.ОчиститьНастройкиКомпоновкиДанных(КомпоновщикНастроек.Настройки);
	
	ДанныеОбъекта = ПолучитьДанныеТекущегоОбъекта();
	
	Если ДанныеОбъекта = Неопределено Тогда
		УстановитьСтраницуКД_Пустая();
		Возврат;
	КонецЕсли;
	
	Если ТекущаяТаблицаИнтеграции <> ДанныеОбъекта.ТаблицаИнтеграции Тогда
		
		ТекущаяТаблицаИнтеграции = ДанныеОбъекта.ТаблицаИнтеграции;
		ЗаполнитьРеквизитыТаблицыРегистра(ТекущаяТаблицаИнтеграции);
		
	КонецЕсли;
	
	Если ИнициализироватьСтраницуНастройкиКомпоновкиДанныхНаСервере(ДанныеОбъекта.ПолучитьИдентификатор()) Тогда
		УстановитьСтраницуКД_Основная();
	Иначе
		УстановитьСтраницуКД_Пустая();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыТаблицыРегистра(ТаблицаИнтеграции)
	
	КолонкиТаблицыИнтеграции.Очистить();
	КолонкиТаблицыИнтеграции.Загрузить(ТекущийМодульМенеджера().ПолучитьКолонкиТаблицыИнтеграции(ТаблицаИнтеграции));
	КолонкиТаблицыИнтеграции.Сортировать("Обязательный УБЫВ");
	
КонецПроцедуры

&НаСервере
Функция ИнициализироватьСтраницуНастройкиКомпоновкиДанныхНаСервере(ИдентификаторОбъекта)
	
	Перем СхемаКД, НастройкиКД;
	
	ДанныеОбъекта = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторОбъекта);
	
	Если ДанныеОбъекта = Неопределено Или ДанныеОбъекта.ЭтоСтрокаТаблицы Или
		Не ЗначениеЗаполнено(ДанныеОбъекта.ИмяОбъектаКонфигурации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеОбъекта.СхемаКомпоновкиДанных) Тогда
		СхемаКД = СхемаКомпоновкиПоЗначению(ДанныеОбъекта.СхемаКомпоновкиДанных);
	КонецЕсли;

	Если СхемаКД = Неопределено Тогда
		
		СхемаКД = НоваяСхемаКомпоновкиПоОбъекту(ДанныеОбъекта.ИмяОбъектаКонфигурации);
		Если СхемаКД = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ДанныеОбъекта.СхемаКомпоновкиДанных = ОбщегоНазначения.ЗначениеВСтрокуXML(СхемаКД);
		ДанныеОбъекта.Модифицированность = Истина;
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеОбъекта.НастройкиКомпоновкиДанных) Тогда
		
		Попытка
			НастройкиКД = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеОбъекта.НастройкиКомпоновкиДанных);
		Исключение
			//@skip-check object-deprecated
			ТекстСообщенияОшибки = СтрШаблон(НСтр("ru = 'Возникла ошибка получения настроек компоновки данных из настройки ""%1: %2"".
			|%3'"), ДанныеОбъекта.ТаблицаИнтеграции, ДанныеОбъекта.Представление, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОшибки);
		КонецПопытки;
		
		Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
			НастройкиКД = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкиКД = Неопределено Тогда
		
		НастройкиКД = Новый НастройкиКомпоновкиДанных();
		SUI_КомпоновкаДанныхКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(НастройкиКД, СхемаКД.НастройкиПоУмолчанию);
		
		ДанныеОбъекта.НастройкиКомпоновкиДанных = ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкиКД);
		ДанныеОбъекта.Модифицированность = Истина;
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Попытка
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, СхемаКД, НастройкиКД,
			СпособВосстановленияНастроекКомпоновкиДанных.Полное);
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(КомпоновщикНастроек);
	Исключение
		//@skip-check object-deprecated
		ТекстСообщенияОшибки = СтрШаблон(НСтр("ru = 'Возникла ошибка инициализации компоновщика настроек ""%1: %2"".
		|%3'"), ДанныеОбъекта.ТаблицаИнтеграции, ДанныеОбъекта.Представление, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция СхемаКомпоновкиПоЗначению(ЗначениеСхемыКД, АдресРезультата = "")
	
	Перем Схема;
	
	ТипЗначенияСхемыКД = ТипЗнч(ЗначениеСхемыКД);
	
	Если ТипЗначенияСхемыКД = Тип("СхемаКомпоновкиДанных") Тогда
		Схема = ЗначениеСхемыКД;
	ИначеЕсли ТипЗначенияСхемыКД = Тип("Строка") И ЗначениеЗаполнено(ЗначениеСхемыКД) Тогда
		
		Попытка
			Схема = ОбщегоНазначения.ЗначениеИзСтрокиXML(ЗначениеСхемыКД);
		Исключение
			//@skip-check object-deprecated
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Возникла ошибка получения схемы компоновки данных
			|%1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
		
		Если ТипЗнч(ЗначениеСхемыКД) = Тип("СхемаКомпоновкиДанных") Тогда
			Схема = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		
		Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
			УдалитьИзВременногоХранилища(АдресРезультата);
		КонецЕсли;
		
		Возврат Неопределено;
		
	Иначе

		Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
			Возврат ПоместитьВоВременноеХранилище(Схема, АдресРезультата);
		Иначе
			Возврат Схема;
		КонецЕсли;

	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция СхемуКомпоновкиДанныхВXMLНаСервере(СхемаКД)
	
	Если ТипЗнч(СхемаКД) = Тип("СхемаКомпоновкиДанных") Тогда
		Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(СхемаКД);
	Иначе
		Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Неопределено);
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция НоваяСхемаКомпоновкиПоОбъекту(ИмяОбъектаКонфигурации, АдресРезультата = "")
	
	Перем Схема;
	
	Если ТекущийМодульМенеджера().ПроверитьОбъектКонфигурации(ИмяОбъектаКонфигурации) Тогда
		
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъектаКонфигурации);
		
		Если МетаданныеОбъекта = Неопределено Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Объект ""%1"" не принадлежит текущей конфигурации'"), ИмяОбъектаКонфигурации);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Иначе
			
			Схема = SUI_КомпоновкаДанныхСервер.ПустаяСхема();
		
			НаборДанных = SUI_КомпоновкаДанныхСервер.ДобавитьПустойНаборДанных(Схема);
			НаборДанных.Запрос = СформироватьТекстЗапросаСхемыКомпоновкиДанныхПоМетаданнымОбъекта(МетаданныеОбъекта);

		КонецЕсли;
		
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		
		Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
			УдалитьИзВременногоХранилища(АдресРезультата);
		КонецЕсли;
		
		Возврат Неопределено;
		
	Иначе

		Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
			Возврат ПоместитьВоВременноеХранилище(Схема, АдресРезультата);
		Иначе
			Возврат Схема;
		КонецЕсли;

	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьТекстЗапросаСхемыКомпоновкиДанныхПоМетаданнымОбъекта(МетаданныеОбъекта)
	
	Перем ТаблицаОбъекта;
	
	ПолноеИмя = МетаданныеОбъекта.ПолноеИмя();
	ИмяОбъекта = МетаданныеОбъекта.Имя;
	
	ВидОбъекта = ВРег(ТекущийМодульМенеджера().ВидОбъектаКонфигурации(ПолноеИмя));
	
	Если ВидОбъекта = "РЕГИСТРСВЕДЕНИЙ" И МетаданныеОбъекта.РазрешитьИтогиСрезПоследних Тогда
		ТаблицаОбъекта = "СрезПоследних";
		ИмяОбъекта = ИмяОбъекта + ТаблицаОбъекта;
	КонецЕсли;
	
	МассивУсловий = Новый Массив();
	Для Каждого ПараметрСКД Из ТекущийМодульМенеджера().ПараметрыСКДПоОбъектуКонфигурации(ПолноеИмя) Цикл
		МассивУсловий.Добавить(ИмяОбъекта + "." + ПараметрСКД + " = &" + ПараметрСКД);
	КонецЦикла;

	КонструкторЗапроса = Новый КонструкторЗапроса("ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	*
	|ИЗ " + ПолноеИмя + ?(ЗначениеЗаполнено(ТаблицаОбъекта), "." + ТаблицаОбъекта, "") + " КАК " + ИмяОбъекта);
	
	КонструкторЗапроса.РежимКомпоновкиДанных = Истина;
	
	ТекстЗапроса = КонструкторЗапроса.Текст;
	
	Если МассивУсловий.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|{ГДЕ
		|	" + СтрСоединить(МассивУсловий, "," + Символы.ПС + Символы.Таб) + "}";
	КонецЕсли;

	Возврат ТекстЗапроса;
	
КонецФункции

#Область КонструкторСхемыКомпоновкиДанных

&НаКлиенте
Процедура ОткрытьКонструкторСхемыКомпоновкиДанных()
	
	#Если ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Тогда
		
		ДанныеОбъекта = ПолучитьДанныеТекущегоОбъекта();
		
		Если ДанныеОбъекта = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ПроверитьКонструкторСКДОткрыт() Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Конструктор схемы компоновки данных уже используется'"));
			Возврат;
		КонецЕсли;
		
		ВладелецСхемыКонструктораСКД = Неопределено;
		
		Схема = СхемаКомпоновкиПоЗначению(ДанныеОбъекта.СхемаКомпоновкиДанных);
		
		Если Схема = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Схема компоновки данных не инициализирована'"));
		Иначе
			
			ВладелецСхемыКонструктораСКД = ДанныеОбъекта.ПолучитьИдентификатор();
			
			КонструкторСКД = Новый КонструкторСхемыКомпоновкиДанных(Схема);
			КонструкторСКД.Редактировать(ЭтотОбъект);
			
		КонецЕсли;
		
	#Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Редактирование схемы компоновки данных доступно только в режиме Толстого клиента'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКонструкторСКДОткрыт()
	
	КонструкторОткрыт = Ложь;
	
	Для Каждого КлиентскоеОкно Из ПолучитьОкна() Цикл
		
		Если КлиентскоеОкно.Заголовок = "Конструктор схемы компоновки данных" Тогда
			КонструкторОткрыт = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КонструкторОткрыт;
			
КонецФункции

&НаКлиенте
Процедура ОткрытьКонструкторСхемыКомпоновкиДанныхЗавершение(Результат)
	
	Если Не ЗначениеЗаполнено(ВладелецСхемыКонструктораСКД) Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Тогда
		
		ДанныеВладельца = ДеревоНастроек.НайтиПоИдентификатору(ВладелецСхемыКонструктораСКД);
		ВладелецСхемыКонструктораСКД = Неопределено;
		
		Если ДанныеВладельца <> Неопределено И Не ДанныеВладельца.ЭтоСтрокаТаблицы Тогда
			
			Схема = Результат.ПолучитьСхему();
			
			Если ПроверитьСхемуКомпоновщиком(Схема) Тогда
				
				ДанныеВладельца.СхемаКомпоновкиДанных = СхемуКомпоновкиДанныхВXMLНаСервере(Схема);
				ДанныеВладельца.Модифицированность = Истина;
				
				Модифицированность = Истина;
				
				ТекущиеДанные = ПолучитьДанныеТекущегоОбъекта();
				
				Если ТекущиеДанные <> Неопределено И 
					ТекущиеДанные.ПолучитьИдентификатор() = ДанныеВладельца.ПолучитьИдентификатор() Тогда
					НачатьИнициализациюСтраницыНастройкиКомпоновкиДанных();
				КонецЕсли;
			
			КонецЕсли;

		КонецЕсли;
		
	#Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Обработка результата конструктора схемы компоновки данных доступна только в режиме Толстого клиента'"));
	#КонецЕсли
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСхемуКомпоновщиком(Схема)
	
	Попытка
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(КомпоновщикНастроек);
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, Схема);
	Исключение
		//@skip-check object-deprecated
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Схема компоновки данных содержит ошибки.
		|%1'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область КомпоновщикНастроек

&НаКлиенте
Процедура УстановитьПризнакМодификацииКомпоновщика()
	
	ДанныеОбъекта = ПолучитьДанныеТекущегоОбъекта();
	
	Если ДанныеОбъекта = Неопределено Тогда
		КомпоновщикМодифицирован = Ложь;
		ВладелецКомпоновщика = Неопределено;
	Иначе
		
		КомпоновщикМодифицирован = Истина;
		ВладелецКомпоновщика = ДанныеОбъекта.ПолучитьИдентификатор();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиКомпоновщикаВладельцу()
	
	Если ЗначениеЗаполнено(КомпоновщикМодифицирован) И ЗначениеЗаполнено(ВладелецКомпоновщика) Тогда
		УстановитьНастройкиКомпоновщикаВладельцуНаСервере(ВладелецКомпоновщика);
	КонецЕсли;
	
	КомпоновщикМодифицирован = Ложь;
	ВладелецКомпоновщика = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиКомпоновщикаВладельцуНаСервере(ИдентификаторВладельца)
	
	ДанныеВладельца = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторВладельца);
	
	Если ДанныеВладельца <> Неопределено Тогда
		
		ДанныеВладельца.НастройкиКомпоновкиДанных = ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.ПолучитьНастройки());
		ДанныеВладельца.Модифицированность = Истина;
		ДанныеВладельца.ЕстьОшибки = Ложь;
		
		РодительВладельца = ДанныеВладельца.ПолучитьРодителя();
		
		Если РодительВладельца <> Неопределено Тогда
			
			Если РодительВладельца.ЕстьОшибки Тогда
				
				ЕстьОшибкиДочерних = Ложь;
				Для Каждого ЭлементыРодителя Из РодительВладельца.ПолучитьЭлементы() Цикл
					
					Если ЭлементыРодителя.ЕстьОшибки Тогда
						ЕстьОшибкиДочерних = Истина;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не ЕстьОшибкиДочерних Тогда
					РодительВладельца.ЕстьОшибки = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроверкаНастроек

&НаКлиенте
Процедура ПроверитьНастройкиКомпоновкиДанных(ТекущиеДанные = Ложь, ОповещениеОЗавершении = Неопределено)
	
	Перем КлючСтроки;
	
	ОчиститьСообщения();
	
	Если ТекущиеДанные Тогда
		
		ТекущиеДанныеНстройки = ПолучитьДанныеТекущегоОбъекта();
		
		Если ТекущиеДанныеНстройки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		КлючСтроки = ТекущиеДанныеНстройки.Ключ;

	КонецЕсли;
	
	УстановитьНастройкиКомпоновщикаВладельцу();
	
	ДлительнаяОперация = ПроверитьНастройкиКомпоновкиДанныхНаСервере(КлючСтроки);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Проверка настроек'");
	ПараметрыОжидания.ВыводитьСообщения = Истина;
//	ПараметрыОжидания.ОтменятьПриЗакрытииФормыВладельца = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьНастройкиКомпоновкиДанныхЗавершение", ЭтотОбъект,
		Новый Структура("ОповещениеОЗавершении", ОповещениеОЗавершении));
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНастройкиКомпоновкиДанныхНаСервере(КлючСтроки = Неопределено)
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДеревоКПроверке", РеквизитФормыВЗначение("ДеревоНастроек", Тип("ДеревоЗначений")));
	ПараметрыПроцедуры.Вставить("КлючСтроки", КлючСтроки);

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПроверитьНастройкиКомпоновкиДанных", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНастройкиКомпоновкиДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	ПроверкаПройдена = Истина;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		КлючиСтрокСОшибками = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);

		Если КлючиСтрокСОшибками.Количество() > 0 Тогда
			ЗаполнитьОшибкиПроверкиВСтрокахДереваНастроек(КлючиСтрокСОшибками);
			ПоказатьПредупреждение(, НСтр("ru = 'Проверка настроек не пройдена'"));
			ПроверкаПройдена = Ложь;
		КонецЕсли;

	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеОЗавершении") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, ПроверкаПройдена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОшибкиПроверкиВСтрокахДереваНастроек(КлючиСтрокСОшибками, Коллекция = Неопределено)
	
	Если Коллекция = Неопределено Тогда
		Коллекция = ДеревоНастроек.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого Элемент Из Коллекция Цикл
		
		Если КлючиСтрокСОшибками.Найти(Элемент.Ключ) <> Неопределено Тогда
			
			Элемент.ЕстьОшибки = Истина;
			
			ЭлементРодитель = Элемент.ПолучитьРодителя();
			Если ЭлементРодитель <> Неопределено Тогда
				ЭлементРодитель.ЕстьОшибки = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьОшибкиПроверкиВСтрокахДереваНастроек(КлючиСтрокСОшибками, Элемент.ПолучитьЭлементы());

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеНастроек

&НаКлиенте
Процедура СохранитьНастройкиИзДерева(ЗакрытьПослеСохранения = Истина)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиИзДереваПослеПроверки", ЭтотОбъект, ЗакрытьПослеСохранения);
		
	Если Модифицированность Тогда
		ПроверитьНастройкиКомпоновкиДанных(, Оповещение);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиИзДереваПослеПроверки(ПроверкаПройдена, ЗакрытьПослеСохранения) Экспорт
	
	Если ПроверкаПройдена Тогда
		
		СохранитьНастройкиИзДереваНаСервере();
		
		Модифицированность = Ложь;

		Если ЗакрытьПослеСохранения Тогда
			НастройкаБылаЗаписана = Неопределено;
			Закрыть(Истина);
		Иначе
			НастройкаБылаЗаписана = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиИзДереваНаСервере()
	
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек", Тип("ДеревоЗначений"));
	
	ТекущийМодульМенеджера().СохранитьДеревоНастроек(Дерево);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
